#4. Дан список:
#list_of_six = [100, 106, 112, 118, 124, 130, 136, 142, 148, 154, 160, 166, 172, 178, 184, 190, 196]
#Напечатать все числа которые делятся на 5 без остатка, но не больше 150.

list_of_six = range(100, 197, 6)
for i in list_of_six:
    if i < 150 and i%5 == 0:
        print(i)